{
  "FileName":"",
  "Created":"2017-01-01T21:23:09.242651174+01:00",
  "Updated":"2017-01-01T21:23:09.242651204+01:00",
  "Title":"Finally an update - about time hey?",
  "Summary":"The latest update since the last one and half years ago..",
  "Body":"\u003cp\u003eAs you can probably tell, I don't add blog posts very often and this is perhaps related to the fact that I still haven't gotten around to completing the blog editor project. TBH, I don't have any motivation to complete that as I don't really blog.... A vicious cycle as you can probably tell. \u003ca href=\"https://github.com/landonia/simplegoblog\"\u003esimplegoblog\u003c/a\u003e was my first go project quite afew years back. If I was to do it again, it would be nothing like the way it is now - but as I or no one else really uses it, there is not much point in changing anything. I will get around to converting the UI to a Hugo theme and transition to that as it just makes much more sense. I only found Hugo as I was considering going down a similar road with simplegoblog and after a very quick search found it (this was a while back). I'm working on too many things at the moment that are more important than another blog engine.\u003c/p\u003e\u003cp\u003eI just completed a very quick little tool that I have put up on github called \u003ca href=\"https://github.com/landonia/gomost\"\u003egomost\u003c/a\u003e that enabled you to host multiple applications/sites from the one box. You can host each site using static files, proxying to some other app or embedding an app within it - or a mixture of them all. I created it as I needed something for all my holding pages and little apps that I now use but could be ran on one simple VPS. I'm currently hosting them all on a $5 Digital Ocean box. Gomost can be setup from one simple configuration file along the lines of:\u003cpre\u003e\u003cbr/\u003eprod: false\u003cbr/\u003eaddr: :8080\u003cbr/\u003eloglevel: trace\u003cbr/\u003estatic: ./static\u003cbr/\u003eproxies:\u003cbr/\u003e  -\u003cbr/\u003e    proxy: www.dev1.com\u003cbr/\u003e    host: http://localhost:8090\u003cbr/\u003e  -\u003cbr/\u003e    proxy: www.dev2.com\u003cbr/\u003e    host: http://localhost:8091\u003cbr/\u003essl:\u003cbr/\u003e  redirecthttp:\u003cbr/\u003e    enable: true\u003cbr/\u003e    addr: :8080\u003cbr/\u003e  DisableLetsEncrypt: false\u003c/pre\u003e\u003c/p\u003e\u003cp\u003eI have added the ability to get automatic SSL certs using letsencrypt - which is enabled by default. I have not added any tests yet and I know there is the possibility of defining incorrect address in combinations that would not make sense. I will get around to adding these tests so people can rest assured it will work as expected. I am currently using it to host all my holding pages and to proxy traffic to this blog. HTTPS is now enabled by default - take a look - it is provided by letsencrypt.\u003c/p\u003e\u003cp\u003eI've also updated the deployment to use Docker now. The apps are each Dockerized and the entire app is deployed using docker compose to make things a little easier. I have to say, I can see how I'm going to make more use of Docker in the day job. I should have done this ages ago.\u003c/p\u003e\u003cp\u003eSo in the months to come, I will be completing a big side project that I've been working on for a while now. I'll hopefully get around to moving this blog over to using Hugo as well, which should enable me to write a bit more than I have been.\u003c/p\u003e"
}
